## Panda Basic

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print(df);

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [8]:
df.head()

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [9]:
df.head(3)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96

In [11]:
df.head()

<bound method NDFrame.head of     X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83>

In [12]:
df.tail()

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [13]:
df.shape

(5, 3)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       5 non-null      int64
 1   Y       5 non-null      int64
 2   Z       5 non-null      int64
dtypes: int64(3)
memory usage: 248.0 bytes

In [17]:
df.describe

<bound method NDFrame.describe of     X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83>

In [16]:
df[['Y', 'Z']]

    Y   Z
0  84  86
1  94  97
2  89  96
3  83  72
4  86  83

In [15]:
df.iloc[2:5, 2]

2    96
3    72
4    83
Name: Z, dtype: int64

In [18]:
df.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [20]:
df.columns = ['apples', 'bananas', 'oranges']

In [21]:
df

   apples  bananas  oranges
0      78       84       86
1      85       94       97
2      96       89       96
3      80       83       72
4      86       86       83

In [23]:
df['bananas'].mean()

87.2

In [24]:
df['bananas'].min()

83

In [25]:
df['bananas'].std()

4.43846820423443

In [27]:
df['bananas'].count()

5

In [26]:
df['bananas'].sort_values(ascending=False)

1    94
2    89
4    86
0    84
3    83
Name: bananas, dtype: int64